import React, { Component } from 'react';
import { Text, View, Image } from 'react-native';
import { ScrollView } from 'react-native-gesture-handler';

class Term extends Component {
    render() {
        return (
            <View style={{ flex: 1 }}>

                <ScrollView>
                    <Text>
                        Netflix ประกาศขึ้นราคาค่าสมาชิกในสหรัฐฯ จากเดิมที่แพ็กเกจพื้นฐาน, มาตรฐาน, และพรีเมียม อยู่ที่ 8, 11, 14 ดอลลาร์ตามลำดับ มาเป็น 9, 13, 16 ดอลลาร์ตามลำดับ โดยแพ็กเกจมาตรฐานขึ้นไป 2 ดอลลาร์หรือถึง 18% นับเป็นการขึ้นราคาแรงที่สุดนับแต่เปิดบริการสตรีมมิ่งมา
    
    ผู้ใช้เดิมจะได้ราคาเดิมต่อไปอีก 3 เดือน ขณะที่ผู้ใช้ใหม่จะได้ราคาใหม่นับแต่วันนี้ไป โดยกระทบถึงผู้ใช้ในประเทศที่คิดค่าบริการเป็นดอลลาร์อีก 40 ประเทศ ในแถบละตินอเมริกา ยกเว้นเฉพาะเม็กซิโกและบราซิล ยังไม่มีข้อมูลว่าผู้ใช้ประเทศอื่นที่คิดค่าบริการสกุลเงินอื่นๆ จะได้รับผลกระทบเมื่อใด แต่ที่ผ่านมา Netflix มีนโยบายตั้งราคาเกือบเท่ากันทั่วโลก จนไม่สามารถแข่งขันได้ในบางประเทศ และต้องยอมออกแพ็กเกจเล็กพิเศษ
    
    แม้ว่าผลประกอบการของ Netflix ยังมีกำไร แต่ในแง่กระแสเงินสดแล้วบริษัทใช้เงินสดลงทุนไปจำนวนมหาศาล ในปี 2018 ทำเงินสดติดลบประมาณ 3,000 ล้านดอลลาร์ รวมเป็นหนี้ถึง 14,000 ล้านดอลลาร์ โดยรอบล่าสุดเพิ่งออกพันธบัตรไป 2,000 ล้านดอลลาร์เมื่อเดือนตุลาคมที่ผ่านมา ขณะที่บริษัทพยายามสร้างรายได้ให้มากขึ้น นับแต่การยกเลิกรับจ่ายเงินผ่าน App Storeล จนมาถึงการขึ้นราคาครั้งนี้
    
    ที่มา - MarketWatch     
    Netflix ประกาศขึ้นราคาค่าสมาชิกในสหรัฐฯ จากเดิมที่แพ็กเกจพื้นฐาน, มาตรฐาน, และพรีเมียม อยู่ที่ 8, 11, 14 ดอลลาร์ตามลำดับ มาเป็น 9, 13, 16 ดอลลาร์ตามลำดับ โดยแพ็กเกจมาตรฐานขึ้นไป 2 ดอลลาร์หรือถึง 18% นับเป็นการขึ้นราคาแรงที่สุดนับแต่เปิดบริการสตรีมมิ่งมา
    
    ผู้ใช้เดิมจะได้ราคาเดิมต่อไปอีก 3 เดือน ขณะที่ผู้ใช้ใหม่จะได้ราคาใหม่นับแต่วันนี้ไป โดยกระทบถึงผู้ใช้ในประเทศที่คิดค่าบริการเป็นดอลลาร์อีก 40 ประเทศ ในแถบละตินอเมริกา ยกเว้นเฉพาะเม็กซิโกและบราซิล ยังไม่มีข้อมูลว่าผู้ใช้ประเทศอื่นที่คิดค่าบริการสกุลเงินอื่นๆ จะได้รับผลกระทบเมื่อใด แต่ที่ผ่านมา Netflix มีนโยบายตั้งราคาเกือบเท่ากันทั่วโลก จนไม่สามารถแข่งขันได้ในบางประเทศ และต้องยอมออกแพ็กเกจเล็กพิเศษ
    
    แม้ว่าผลประกอบการของ Netflix ยังมีกำไร แต่ในแง่กระแสเงินสดแล้วบริษัทใช้เงินสดลงทุนไปจำนวนมหาศาล ในปี 2018 ทำเงินสดติดลบประมาณ 3,000 ล้านดอลลาร์ รวมเป็นหนี้ถึง 14,000 ล้านดอลลาร์ โดยรอบล่าสุดเพิ่งออกพันธบัตรไป 2,000 ล้านดอลลาร์เมื่อเดือนตุลาคมที่ผ่านมา ขณะที่บริษัทพยายามสร้างรายได้ให้มากขึ้น นับแต่การยกเลิกรับจ่ายเงินผ่าน App Storeล จนมาถึงการขึ้นราคาครั้งนี้
    
    ที่มา - MarketWatch     
    Netflix ประกาศขึ้นราคาค่าสมาชิกในสหรัฐฯ จากเดิมที่แพ็กเกจพื้นฐาน, มาตรฐาน, และพรีเมียม อยู่ที่ 8, 11, 14 ดอลลาร์ตามลำดับ มาเป็น 9, 13, 16 ดอลลาร์ตามลำดับ โดยแพ็กเกจมาตรฐานขึ้นไป 2 ดอลลาร์หรือถึง 18% นับเป็นการขึ้นราคาแรงที่สุดนับแต่เปิดบริการสตรีมมิ่งมา
    
    ผู้ใช้เดิมจะได้ราคาเดิมต่อไปอีก 3 เดือน ขณะที่ผู้ใช้ใหม่จะได้ราคาใหม่นับแต่วันนี้ไป โดยกระทบถึงผู้ใช้ในประเทศที่คิดค่าบริการเป็นดอลลาร์อีก 40 ประเทศ ในแถบละตินอเมริกา ยกเว้นเฉพาะเม็กซิโกและบราซิล ยังไม่มีข้อมูลว่าผู้ใช้ประเทศอื่นที่คิดค่าบริการสกุลเงินอื่นๆ จะได้รับผลกระทบเมื่อใด แต่ที่ผ่านมา Netflix มีนโยบายตั้งราคาเกือบเท่ากันทั่วโลก จนไม่สามารถแข่งขันได้ในบางประเทศ และต้องยอมออกแพ็กเกจเล็กพิเศษ
    
    แม้ว่าผลประกอบการของ Netflix ยังมีกำไร แต่ในแง่กระแสเงินสดแล้วบริษัทใช้เงินสดลงทุนไปจำนวนมหาศาล ในปี 2018 ทำเงินสดติดลบประมาณ 3,000 ล้านดอลลาร์ รวมเป็นหนี้ถึง 14,000 ล้านดอลลาร์ โดยรอบล่าสุดเพิ่งออกพันธบัตรไป 2,000 ล้านดอลลาร์เมื่อเดือนตุลาคมที่ผ่านมา ขณะที่บริษัทพยายามสร้างรายได้ให้มากขึ้น นับแต่การยกเลิกรับจ่ายเงินผ่าน App Storeล จนมาถึงการขึ้นราคาครั้งนี้
    
    ที่มา - MarketWatch     
    Netflix ประกาศขึ้นราคาค่าสมาชิกในสหรัฐฯ จากเดิมที่แพ็กเกจพื้นฐาน, มาตรฐาน, และพรีเมียม อยู่ที่ 8, 11, 14 ดอลลาร์ตามลำดับ มาเป็น 9, 13, 16 ดอลลาร์ตามลำดับ โดยแพ็กเกจมาตรฐานขึ้นไป 2 ดอลลาร์หรือถึง 18% นับเป็นการขึ้นราคาแรงที่สุดนับแต่เปิดบริการสตรีมมิ่งมา
    
    ผู้ใช้เดิมจะได้ราคาเดิมต่อไปอีก 3 เดือน ขณะที่ผู้ใช้ใหม่จะได้ราคาใหม่นับแต่วันนี้ไป โดยกระทบถึงผู้ใช้ในประเทศที่คิดค่าบริการเป็นดอลลาร์อีก 40 ประเทศ ในแถบละตินอเมริกา ยกเว้นเฉพาะเม็กซิโกและบราซิล ยังไม่มีข้อมูลว่าผู้ใช้ประเทศอื่นที่คิดค่าบริการสกุลเงินอื่นๆ จะได้รับผลกระทบเมื่อใด แต่ที่ผ่านมา Netflix มีนโยบายตั้งราคาเกือบเท่ากันทั่วโลก จนไม่สามารถแข่งขันได้ในบางประเทศ และต้องยอมออกแพ็กเกจเล็กพิเศษ
    
    แม้ว่าผลประกอบการของ Netflix ยังมีกำไร แต่ในแง่กระแสเงินสดแล้วบริษัทใช้เงินสดลงทุนไปจำนวนมหาศาล ในปี 2018 ทำเงินสดติดลบประมาณ 3,000 ล้านดอลลาร์ รวมเป็นหนี้ถึง 14,000 ล้านดอลลาร์ โดยรอบล่าสุดเพิ่งออกพันธบัตรไป 2,000 ล้านดอลลาร์เมื่อเดือนตุลาคมที่ผ่านมา ขณะที่บริษัทพยายามสร้างรายได้ให้มากขึ้น นับแต่การยกเลิกรับจ่ายเงินผ่าน App Storeล จนมาถึงการขึ้นราคาครั้งนี้
    
    ที่มา - MarketWatch     
    Netflix ประกาศขึ้นราคาค่าสมาชิกในสหรัฐฯ จากเดิมที่แพ็กเกจพื้นฐาน, มาตรฐาน, และพรีเมียม อยู่ที่ 8, 11, 14 ดอลลาร์ตามลำดับ มาเป็น 9, 13, 16 ดอลลาร์ตามลำดับ โดยแพ็กเกจมาตรฐานขึ้นไป 2 ดอลลาร์หรือถึง 18% นับเป็นการขึ้นราคาแรงที่สุดนับแต่เปิดบริการสตรีมมิ่งมา
    
    ผู้ใช้เดิมจะได้ราคาเดิมต่อไปอีก 3 เดือน ขณะที่ผู้ใช้ใหม่จะได้ราคาใหม่นับแต่วันนี้ไป โดยกระทบถึงผู้ใช้ในประเทศที่คิดค่าบริการเป็นดอลลาร์อีก 40 ประเทศ ในแถบละตินอเมริกา ยกเว้นเฉพาะเม็กซิโกและบราซิล ยังไม่มีข้อมูลว่าผู้ใช้ประเทศอื่นที่คิดค่าบริการสกุลเงินอื่นๆ จะได้รับผลกระทบเมื่อใด แต่ที่ผ่านมา Netflix มีนโยบายตั้งราคาเกือบเท่ากันทั่วโลก จนไม่สามารถแข่งขันได้ในบางประเทศ และต้องยอมออกแพ็กเกจเล็กพิเศษ
    
    แม้ว่าผลประกอบการของ Netflix ยังมีกำไร แต่ในแง่กระแสเงินสดแล้วบริษัทใช้เงินสดลงทุนไปจำนวนมหาศาล ในปี 2018 ทำเงินสดติดลบประมาณ 3,000 ล้านดอลลาร์ รวมเป็นหนี้ถึง 14,000 ล้านดอลลาร์ โดยรอบล่าสุดเพิ่งออกพันธบัตรไป 2,000 ล้านดอลลาร์เมื่อเดือนตุลาคมที่ผ่านมา ขณะที่บริษัทพยายามสร้างรายได้ให้มากขึ้น นับแต่การยกเลิกรับจ่ายเงินผ่าน App Storeล จนมาถึงการขึ้นราคาครั้งนี้
    
    ที่มา - MarketWatch     
    Netflix ประกาศขึ้นราคาค่าสมาชิกในสหรัฐฯ จากเดิมที่แพ็กเกจพื้นฐาน, มาตรฐาน, และพรีเมียม อยู่ที่ 8, 11, 14 ดอลลาร์ตามลำดับ มาเป็น 9, 13, 16 ดอลลาร์ตามลำดับ โดยแพ็กเกจมาตรฐานขึ้นไป 2 ดอลลาร์หรือถึง 18% นับเป็นการขึ้นราคาแรงที่สุดนับแต่เปิดบริการสตรีมมิ่งมา
    
    ผู้ใช้เดิมจะได้ราคาเดิมต่อไปอีก 3 เดือน ขณะที่ผู้ใช้ใหม่จะได้ราคาใหม่นับแต่วันนี้ไป โดยกระทบถึงผู้ใช้ในประเทศที่คิดค่าบริการเป็นดอลลาร์อีก 40 ประเทศ ในแถบละตินอเมริกา ยกเว้นเฉพาะเม็กซิโกและบราซิล ยังไม่มีข้อมูลว่าผู้ใช้ประเทศอื่นที่คิดค่าบริการสกุลเงินอื่นๆ จะได้รับผลกระทบเมื่อใด แต่ที่ผ่านมา Netflix มีนโยบายตั้งราคาเกือบเท่ากันทั่วโลก จนไม่สามารถแข่งขันได้ในบางประเทศ และต้องยอมออกแพ็กเกจเล็กพิเศษ
    
    แม้ว่าผลประกอบการของ Netflix ยังมีกำไร แต่ในแง่กระแสเงินสดแล้วบริษัทใช้เงินสดลงทุนไปจำนวนมหาศาล ในปี 2018 ทำเงินสดติดลบประมาณ 3,000 ล้านดอลลาร์ รวมเป็นหนี้ถึง 14,000 ล้านดอลลาร์ โดยรอบล่าสุดเพิ่งออกพันธบัตรไป 2,000 ล้านดอลลาร์เมื่อเดือนตุลาคมที่ผ่านมา ขณะที่บริษัทพยายามสร้างรายได้ให้มากขึ้น นับแต่การยกเลิกรับจ่ายเงินผ่าน App Storeล จนมาถึงการขึ้นราคาครั้งนี้
    
    ที่มา - MarketWatch     
                    </Text>
                </ScrollView>

            </View>


        );
    }
}


export default Term;
