import React, { Component } from 'react';
import { Text, View, Image } from 'react-native';
import { ScrollView } from 'react-native-gesture-handler';

class Term extends Component {
    render() {
        return (
            <View style={{ flex: 1 }}>

                <ScrollView>
                    <Text>{`
        Terms and Condition
        
    1. การทำการจองตู็ล็อกเกอร์ จะใช้ 5 คะแนน ในการจอง
    2. หากมีการใช้งานตู้ล็อกเกอร์ตามที่ได้ทำการจองไว้ ระบบจะคืนคะแนนให้ 5 คะแนน
    3. หากตู้ล็อกเกอร์ไม่ได้ใช้งานตามที่ได้ทำการจองไว้ ระบบจะสงวนการคืนคะแนนให้ 5 คะแนน
    4. หากผู้ใช้งานทำการจองตู้ล็อกเกอร์ไว้ และไม่ได้ใช้งาน ระบบจะตัดคะแนนของคุณ 10 คะแนน ในทุก ๆ 4 ครั้งที่ทำการจองตู้ล็อกเกอร์และไม่ได้ใช้งาน
    5. ผู้ใช้งานสามารถยกเลิกการจองตู้ล็อกเกอร์ได้ หากผู้ใช้งานยกเลิกการจองตู้ล็อกเกอร์ก่อนเวลาการใช้งานตู้ล็อกเกอร์ ผู้ใช้งานจะได้คะแนนคืน 5 คะแนน 
    6. ผู้ใช้งานไม่สามารถยกเลิกการจองตู้ล็อกเกอร์ หากผู้ใช้งานยกเลิกการจองตู้ล็อกเกอร์หลังเวลาการใช้งานตู้ล็อกเกอร์
                            
                            `}</Text>
                </ScrollView>

            </View>


        );
    }
}


export default Term;
